codes = {
    'meals': {
        '000': '食事なし',
        '001': '朝食付',
        '002': '夕食付',
        '003': '夕朝食付',
        '004': '朝昼食付',
        '005': '昼食付',
        '006': '3食付',
        '007': '昼夕食付'
    },
    'roomTypes': {
        '00': 'シングル',
        '01': 'ツイン',
        '02': 'ダブル',
        '03': 'トリプル',
        '04': 'フォース',
        '05': '和室',
        '06': '和洋室',
        '07': 'セミダブル',
        '08': '一等貸し',
        '99': '設定なし'
    },
    'roomAttributes': {
        '20': '禁煙',
        '31': '喫煙',
        '18': '露天風呂客室',
        '19': 'クラブフロア',
        '13': 'スイート',
        '14': '特別室・貴賓室',
        '10': '高層階',
        '15': '離れ・コテージ',
        '12': 'ペットOK',
        '3':  'バルコニーテラス付き',
        '24': '夜景が自慢',
        '26': 'お風呂から景色',
        '25': 'オーシャンビュー',
        '1':  '40平米以上',
        '7':  'ベッド幅160cm～',
        '27': 'バストイレ別',
        '5':  '洗い場付バス',
        '4':  'シャワーブース付き',
        '2':  'ジェットバス付',
        '11': 'バリアフリー'
    }
}

print(codes)